In [ ]:
#apply  데이터 하나씩 값을 짚어넣고 받을수 있다. 
#필요한것 : 함수 , 람다식 
데이터 프레임

# def 함수이름 (매개변수) : 
#    동작
#    return 값

In [3]:
#제곱을 계산하는 함수 

def my_sq(x):
    return x**2
def my_exp(x,n):
    return x**n
my_sq(5)
my_exp(5,4)

625

In [4]:
import pandas as pd

In [5]:
dic = {
    'a' : [10,20,30],
    'b' : [20,30,40]
}

In [10]:
dic   #dictionaly형태

{'a': [10, 20, 30], 'b': [20, 30, 40]}

In [7]:
df = pd.DataFrame(dic)

In [8]:
df

    a   b
0  10  20
1  20  30
2  30  40

In [13]:
df['a'] **2  #제곱

0    100
1    400
2    900
Name: a, dtype: int64

In [14]:
df['a'] *2 # *2

0    20
1    40
2    60
Name: a, dtype: int64

In [23]:
df['a'].apply(my_sq) #apply도 같은 결과를 나타내지만 첫번째 선택한 것이 하나씩 apply안에 들어간다.


#def my_sq(x):
#    return x**2

0    100
1    400
2    900
Name: a, dtype: int64

In [16]:
df['a']**4

0     10000
1    160000
2    810000
Name: a, dtype: int64

In [17]:
df['a'].apply(my_exp,n=4)

#def my_exp(x,n):
#    return x**n

0     10000
1    160000
2    810000
Name: a, dtype: int64

In [18]:
def print_me(x):
    print(x)

In [19]:
df.apply(print_me)  #index=1  과 index=2 가 있다.

0    10
1    20
2    30
Name: a, dtype: int64
0    20
1    30
2    40
Name: b, dtype: int64

a    None
b    None
dtype: object

In [20]:
df

    a   b
0  10  20
1  20  30
2  30  40

In [21]:
df.apply(print_me,axis=1)   # index = 0 , 1 , 2

a    10
b    20
Name: 0, dtype: int64
a    20
b    30
Name: 1, dtype: int64
a    30
b    40
Name: 2, dtype: int64

0    None
1    None
2    None
dtype: object

In [27]:
import numpy as np
df.apply(np.min, axis=1)  #axis가 0(행)일떄는 index값이 변화가 있다. (세로) // axis가 1(열)일떄는 컬럼단위로 데이터가 들어간다 (가로)

#df가 DataFrame인데

0    10
1    20
2    30
dtype: int64

In [29]:
def avg_3(x,y,z):
    print(x)
    print(y)
    print(z)
    return (x+y+z)/3

In [30]:
df.apply(avg_3,y=1,z=1) #apply에서 데이터가 많아지면 이렇게 값을 넣어줘야함. 함수 말고

0    10
1    20
2    30
Name: a, dtype: int64
1
1
0    10
1    20
2    30
Name: a, dtype: int64
1
1
0    20
1    30
2    40
Name: b, dtype: int64
1
1

           a          b
0   4.000000   7.333333
1   7.333333  10.666667
2  10.666667  14.000000

In [31]:
(30+1+1)/3

10.666666666666666

In [37]:
def avg_multi(col):
    sum = 0
    for item in col:
        sum += item
    return sum/df.shape[0]  #shape는 행,열 개수가 나오겟지

In [38]:
df.apply(avg_multi,axis=0)  #이것의 결과는 a의 총합을 더해서 평균= b의 총합을 더해서 평균=

a    20.0
b    30.0
dtype: float64

In [34]:
import seaborn as sns

In [35]:
titanic = sns.load_dataset('titanic')

In [36]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.6+ KB

In [46]:
titanic.head(4)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False

In [39]:
def count_missing(vec):
    null_vec = pd.isnull(vec)
    null_count = np.sum(null_vec)
    return null_count

In [41]:
np.sum(pd.isnull(titanic['age']))

177

In [42]:
pd.isnull(titanic['age'])

0      False
1      False
2      False
3      False
4      False
       ...
886    False
887    False
888     True
889    False
890    False
Name: age, Length: 891, dtype: bool

In [50]:
titanic.apply(count_missing,axis=0) ##그러니깐 열 전체를 읽는다.index값이 바뀐다.

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [48]:
titanic.apply(count_missing,axis=1) # 행을 고정한 상태로 컬럼을 컬럼을 읽는다.

0      1
1      0
2      1
3      0
4      1
      ..
886    1
887    0
888    2
889    0
890    1
Length: 891, dtype: int64

In [53]:
def prop_missing(vec):  #비어있는 비율 구하기
    num = count_missing(vec)
    dem = vec.size
    return num/dem

In [54]:
titanic.apply(prop_missing)

survived       0.000000
pclass         0.000000
sex            0.000000
age            0.198653
sibsp          0.000000
parch          0.000000
fare           0.000000
embarked       0.002245
class          0.000000
who            0.000000
adult_male     0.000000
deck           0.772166
embark_town    0.002245
alive          0.000000
alone          0.000000
dtype: float64

In [55]:
def prop_complete(vec): 
    return 1-prop_missing(vec)

In [56]:
titanic.apply(prop_complete)

survived       1.000000
pclass         1.000000
sex            1.000000
age            0.801347
sibsp          1.000000
parch          1.000000
fare           1.000000
embarked       0.997755
class          1.000000
who            1.000000
adult_male     1.000000
deck           0.227834
embark_town    0.997755
alive          1.000000
alone          1.000000
dtype: float64

In [ ]:
#Series의 agg

In [57]:
s = pd.Series([1,2,3,4])
type(s)

pandas.core.series.Series

In [59]:
s.agg(np.max)

4

In [61]:
s.agg(['sum','max','min'])

sum    10
max     4
min     1
dtype: int64

In [ ]:
#DataFrame의 agg

In [63]:
df = pd.DataFrame([[1, 2, 3],
                   [4, 5, 6],
                   [7, 8, 9],
                   [np.nan, np.nan, np.nan]],
                  columns=['A', 'B', 'C'])

In [64]:
df

     A    B    C
0  1.0  2.0  3.0
1  4.0  5.0  6.0
2  7.0  8.0  9.0
3  NaN  NaN  NaN

In [68]:
df.agg(['sum','max','min','mean'],axis=0) #열이 고정되고

         A     B     C
sum   12.0  15.0  18.0
max    7.0   8.0   9.0
min    1.0   2.0   3.0
mean   4.0   5.0   6.0

In [67]:
df.agg(['sum','max','min','mean'],axis=1)  #행이 고정되고

    sum  max  min  mean
0   6.0  3.0  1.0   2.0
1  15.0  6.0  4.0   5.0
2  24.0  9.0  7.0   8.0
3   0.0  NaN  NaN   NaN

In [69]:
df.agg({'A':['sum','min'],'B':['mean']})

         A    B
mean   NaN  5.0
min    1.0  NaN
sum   12.0  NaN

In [70]:
def my_mean(values):
    n = len(values)
    sum = 0
    for value in values:
        sum += value
    return sum/n

In [ ]:
############################################

In [71]:
df = pd.read_csv('../data/gapminder.tsv',sep='\t')

In [72]:
df.head(5)

       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
1  Afghanistan      Asia  1957   30.332   9240934  820.853030
2  Afghanistan      Asia  1962   31.997  10267083  853.100710
3  Afghanistan      Asia  1967   34.020  11537966  836.197138
4  Afghanistan      Asia  1972   36.088  13079460  739.981106

In [73]:
df.groupby('year').lifeExp.mean()

year
1952    49.057620
1957    51.507401
1962    53.609249
1967    55.678290
1972    57.647386
1977    59.570157
1982    61.533197
1987    63.212613
1992    64.160338
1997    65.014676
2002    65.694923
2007    67.007423
Name: lifeExp, dtype: float64

In [ ]:
df.groupby('year').lifeExp.agg(my_mean)